<h1>Tabla de contenidos<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Data-aggregation" data-toc-modified-id="Data-aggregation-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Data aggregation</a></span><ul class="toc-item"><li><span><a href="#groupby" data-toc-modified-id="groupby-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>groupby</a></span><ul class="toc-item"><li><span><a href="#groupby-&amp;-aggregate" data-toc-modified-id="groupby-&amp;-aggregate-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>groupby &amp; aggregate</a></span></li></ul></li><li><span><a href="#Pivot-Tables" data-toc-modified-id="Pivot-Tables-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Pivot Tables</a></span></li><li><span><a href="#Differences-between-pivot-table-and-groupby-function" data-toc-modified-id="Differences-between-pivot-table-and-groupby-function-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Differences between pivot table and groupby function</a></span></li><li><span><a href="#crosstab" data-toc-modified-id="crosstab-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>crosstab</a></span></li></ul></li><li><span><a href="#Data-combination:-mixing-dataframes" data-toc-modified-id="Data-combination:-mixing-dataframes-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Data combination: mixing dataframes</a></span><ul class="toc-item"><li><span><a href="#Concat:-two-things-together" data-toc-modified-id="Concat:-two-things-together-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Concat: two things together</a></span><ul class="toc-item"><li><span><a href="#Concatenating-on-axis-0-(rows)" data-toc-modified-id="Concatenating-on-axis-0-(rows)-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>Concatenating on axis 0 (rows)</a></span></li><li><span><a href="#Concatenating-on-axis-1-(columns)" data-toc-modified-id="Concatenating-on-axis-1-(columns)-2.1.2"><span class="toc-item-num">2.1.2&nbsp;&nbsp;</span>Concatenating on axis 1 (columns)</a></span></li></ul></li><li><span><a href="#Merge:-related-columns" data-toc-modified-id="Merge:-related-columns-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Merge: related columns</a></span><ul class="toc-item"><li><span><a href="#LEFT-Merge" data-toc-modified-id="LEFT-Merge-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>LEFT Merge</a></span></li><li><span><a href="#RIGHT-Merge" data-toc-modified-id="RIGHT-Merge-2.2.2"><span class="toc-item-num">2.2.2&nbsp;&nbsp;</span>RIGHT Merge</a></span></li><li><span><a href="#INNER-Merge" data-toc-modified-id="INNER-Merge-2.2.3"><span class="toc-item-num">2.2.3&nbsp;&nbsp;</span>INNER Merge</a></span></li><li><span><a href="#OUTER-Merge" data-toc-modified-id="OUTER-Merge-2.2.4"><span class="toc-item-num">2.2.4&nbsp;&nbsp;</span>OUTER Merge</a></span></li></ul></li><li><span><a href="#Merging-&amp;-Concatenating-in-two-different-columns" data-toc-modified-id="Merging-&amp;-Concatenating-in-two-different-columns-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Merging &amp; Concatenating in two different columns</a></span><ul class="toc-item"><li><span><a href="#Concatenating-in-two-different-columns" data-toc-modified-id="Concatenating-in-two-different-columns-2.3.1"><span class="toc-item-num">2.3.1&nbsp;&nbsp;</span>Concatenating in two different columns</a></span></li><li><span><a href="#Merging-in-two-different-columns" data-toc-modified-id="Merging-in-two-different-columns-2.3.2"><span class="toc-item-num">2.3.2&nbsp;&nbsp;</span>Merging in two different columns</a></span></li></ul></li><li><span><a href="#Join:-relating-index" data-toc-modified-id="Join:-relating-index-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Join: relating index</a></span></li><li><span><a href="#Differences-between-join-&amp;-merge" data-toc-modified-id="Differences-between-join-&amp;-merge-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>Differences between join &amp; merge</a></span></li></ul></li><li><span><a href="#Pandas-usual-methods" data-toc-modified-id="Pandas-usual-methods-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Pandas usual methods</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

![](https://miro.medium.com/max/1400/1*6d5dw6dPhy4vBp2vRW6uzw.webp)

Primero, importamos las librerías principales:

In [2]:
import pandas as pd
import numpy as np

Cargamos un nuevo dataset.

In [3]:
df = pd.read_csv("datasets/employees.csv")

what is it about? Let's look at it all together:

In [4]:
df

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,36,No,Travel_Frequently,884,Research & Development,23,2,Medical,1,2061,...,3,80,1,17,3,3,5,2,0,3
1466,39,No,Travel_Rarely,613,Research & Development,6,1,Medical,1,2062,...,1,80,1,9,5,3,7,7,1,7
1467,27,No,Travel_Rarely,155,Research & Development,4,3,Life Sciences,1,2064,...,2,80,1,6,0,3,6,2,0,3
1468,49,No,Travel_Frequently,1023,Sales,2,3,Medical,1,2065,...,4,80,0,17,3,2,9,6,0,8
1469,34,No,Travel_Rarely,628,Research & Development,8,3,Medical,1,2068,...,1,80,0,6,3,4,4,3,1,2

In [5]:
# time to code

## Data aggregation

La agregación de datos es una técnica fundamental en el análisis de datos que implica agrupar y resumir datos para obtener información y tomar decisiones informadas. En esta sección, exploraremos métodos esenciales de Pandas para la agregación de datos, incluyendo `groupby`, `pivot_table` y `crosstab`.

Estas técnicas son particularmente útiles cuando se trata de grandes conjuntos de datos o cuando necesitas resumir datos a través de diferentes categorías o dimensiones. Ya sea que quieras calcular estadísticas para grupos específicos, crear tablas resumen o analizar relaciones entre variables, los métodos de agregación de datos en Pandas proporcionan las herramientas para agilizar tu análisis.

Vamos a sumergirnos en cada uno de estos métodos y descubrir cómo pueden ayudarte a descubrir patrones y tendencias significativas dentro de tus datos.

### groupby

Pandas GroupBy es una función poderosa y versátil en Python que es indispensable para la manipulación y análisis de datos. Nos permite dividir un DataFrame en grupos separados basados en uno o más criterios y realizar varios cálculos sobre estos grupos para un análisis profundo.

El concepto es sencillo: seleccionas un DataFrame, especificas las categorías o criterios por los cuales quieres agrupar tus datos, y luego aplicas funciones de agregación a cada grupo. Estas funciones de agregación pueden incluir cálculos como sumar, promediar, contar, o incluso funciones definidas por el usuario, dependiendo de tus objetivos de análisis.

Las operaciones de GroupBy son invaluables para tareas como resumir datos, explorar patrones dentro de grupos específicos, o comparar diferentes segmentos de tu conjunto de datos. Ya estés trabajando con datos de ventas, comportamiento del cliente, o cualquier otro tipo de datos estructurados, Pandas GroupBy es tu herramienta de elección.

Aquí tienes una sintaxis básica para usar GroupBy:

`df[subset].groupby(category).aggregation()`

Para profundizar en las capacidades y opciones de Pandas GroupBy, puedes referirte a la documentación oficial [aquí](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html).

`groupby the departments and their mean age`

In [6]:
# Hay dos formas de hacerlo (1st)
df[["Age", "Department"]].groupby("Department").mean()

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

In [7]:
# Hay dos formas de hacerlo (2nd)
df[["Age", "Department"]].groupby("Department").agg("mean")

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

`groupby the departments and their maximum age`

In [8]:
# Hay dos formas de hacerlo (1st)
df[["Age", "Department"]].groupby("Department").agg({"Age":"max"})

                        Age
Department
Human Resources          59
Research & Development   60
Sales                    60

In [9]:
# Hay dos formas de hacerlo (2nd)
df[["Age", "Department"]].groupby("Department").max()

                        Age
Department
Human Resources          59
Research & Development   60
Sales                    60

`groupby the departments and their min age`

In [10]:
# Hay dos formas de hacerlo  (1st)
df[["Age", "Department"]].groupby("Department").agg({"Age":"min"})

                        Age
Department
Human Resources          19
Research & Development   18
Sales                    18

In [11]:
# Hay dos formas de hacerlo  (2nd)
df[["Age", "Department"]].groupby("Department").min()

                        Age
Department
Human Resources          19
Research & Development   18
Sales                    18

`groupby: 2+`: Diferentes campos de educación y sus salarios medios en cada uno de los departamentos

In [12]:
df[["EducationField", "HourlyRate", "Department"]].groupby(by=["Department", "EducationField"]).agg({"HourlyRate":"mean"})

                                         HourlyRate
Department             EducationField
Human Resources        Human Resources    60.888889
                       Life Sciences      61.625000
                       Medical            72.076923
                       Other              76.000000
                       Technical Degree   64.000000
Research & Development Life Sciences      66.570455
                       Medical            66.330579
                       Other              62.203125
                       Technical Degree   66.351064
Sales                  Life Sciences      68.153333
                       Marketing          66.150943
                       Medical            59.943182
                       Other              60.333333
                       Technical Degree   67.676471

In [13]:
df[["EducationField", "HourlyRate", "Department"]].groupby(by=["EducationField", "Department"]).agg({"HourlyRate":"mean"})

                                         HourlyRate
EducationField   Department
Human Resources  Human Resources          60.888889
Life Sciences    Human Resources          61.625000
                 Research & Development   66.570455
                 Sales                    68.153333
Marketing        Sales                    66.150943
Medical          Human Resources          72.076923
                 Research & Development   66.330579
                 Sales                    59.943182
Other            Human Resources          76.000000
                 Research & Development   62.203125
                 Sales                    60.333333
Technical Degree Human Resources          64.000000
                 Research & Development   66.351064
                 Sales                    67.676471

`more fields`

In [14]:
df[["EducationField", "HourlyRate", "Department", "StandardHours", "Age"]].groupby(by=["Department", "EducationField"]).mean()

                                         HourlyRate  StandardHours        Age
Department             EducationField
Human Resources        Human Resources    60.888889           80.0  37.037037
                       Life Sciences      61.625000           80.0  39.375000
                       Medical            72.076923           80.0  39.846154
                       Other              76.000000           80.0  34.666667
                       Technical Degree   64.000000           80.0  32.500000
Research & Development Life Sciences      66.570455           80.0  36.997727
                       Medical            66.330579           80.0  37.242424
                       Other              62.203125           80.0  36.187500
                       Technical Degree   66.351064           80.0  37.063830
Sales                  Life Sciences      68.153333           80.0  37.186667
                       Marketing          66.150943           80.0  37.924528
                       Medical            59.943182           80.0  34.727273
                       Other              60.333333           80.0  32.000000
                       Technical Degree   67.676471           80.0  33.941176

#### groupby & aggregate

En Pandas, la función "agg" se utiliza para agregar datos dentro de los grupos creados mediante GroupBy. Permite aplicar múltiples funciones de agregación a la vez, ofreciendo un control detallado sobre el resumen de tus datos.

Estas son algunas funciones de agregación comunes disponibles con "agg":
- **mean**: Calcula el promedio de los valores en cada grupo.
- **sum**: Suma todos los valores en cada grupo.
- **count**: Cuenta el número de filas en cada grupo.

Con "agg", puedes especificar estas y otras funciones de agregación, adaptando el resumen de tus datos a tus necesidades específicas de análisis. Esta capacidad es muy útil cuando necesitas obtener distintas estadísticas de tus datos agrupados al mismo tiempo.

Para más detalles sobre la función "agg" y sus opciones avanzadas, puedes consultar la documentación oficial de Pandas [aquí](https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.aggregate.html).

### Tablas dinámicas

Las tablas dinámicas son esenciales en análisis de datos, especialmente cuando necesitas analizar y comparar varios aspectos de tu conjunto de datos de manera simultánea. Pandas ofrece la función `pivot_table`, que permite crear tablas dinámicas estilo hoja de cálculo dentro de un DataFrame.

La función `pivot_table` acepta varios parámetros clave:
- `df`: El DataFrame que deseas pivotar.
- `values`: Las columnas que contienen los valores para agregar.
- `index`: Las columnas que se convertirán en el nuevo índice de la tabla dinámica.
- `columns`: Las columnas que se convertirán en las nuevas columnas de la tabla dinámica.
- `aggfunc`: La función de agregación que se aplicará a los valores (el valor por defecto es 'mean').

Al aplicar `pivot_table`, tu data se organiza en un formato más estructurado, facilitando operaciones de agregación como el cálculo de medias, sumas o conteos a través de diferentes grupos y dimensiones.

Para una guía detallada sobre cuándo usar `groupby` en comparación con `pivot_table`, puedes revisar el siguiente artículo: [GroupBy vs. Pivot Table](https://towardsdatascience.com/a-comparison-of-groupby-and-pivot-in-pythons-pandas-module-527909e78d6b).

Aprovechar las tablas dinámicas puede mejorar significativamente tu análisis de datos, ayudándote a descubrir insights en conjuntos de datos complejos.

Para conocer más sobre `pivot_table` y sus opciones avanzadas, consulta la documentación oficial de Pandas [aquí](https://pandas.pydata.org/docs/reference/api/pandas.pivot_table.html).

`tabla dinámica`: el departamento y sus edades medias

In [15]:
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [16]:
# Ejemplo, calculando media de edad por departamento
df.pivot_table(
    values = "Age",
    index = "Department",
    aggfunc = "mean"
)

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

Now, is your **turn**:

`pivot table`: el departamento y sus edades max

In [17]:
df.pivot_table(
    values = "Age",
    index = "Department",
    aggfunc = "max"
)

                        Age
Department
Human Resources          59
Research & Development   60
Sales                    60

`pivot table`: el departamento y sus edades min

In [18]:
df.pivot_table(
    values = "Age",
    index = "Department",
    aggfunc = "min"
)

                        Age
Department
Human Resources          19
Research & Development   18
Sales                    18

`pivot table`: el departamento y media de edad

In [19]:
df.pivot_table(
    values = "Age",
    index = "Department",
    aggfunc = "mean"
)

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

`multi-index pivot table`: salario máximo de los empleados por departamento y campo de educación.

In [20]:
# Example, calculating mean age by department and EducationField

df.pivot_table (
    values = "MonthlyIncome",
    index = ["Department", "EducationField"],
    aggfunc = "max"
)

                                         MonthlyIncome
Department             EducationField
Human Resources        Human Resources           19636
                       Life Sciences             19717
                       Medical                   18200
                       Other                      7988
                       Technical Degree           4323
Research & Development Life Sciences             19999
                       Medical                   19859
                       Other                     19613
                       Technical Degree          19943
Sales                  Life Sciences             19847
                       Marketing                 19845
                       Medical                   19833
                       Other                     10932
                       Technical Degree          16872

### crosstab

En el análisis de datos, comprender las relaciones entre variables categóricas es a menudo crucial para obtener insights sobre tu conjunto de datos. Pandas ofrece una herramienta llamada `crosstab` que te ayuda a computar una simple tabulación cruzada de dos o más factores dentro de tu DataFrame.

La función `pd.crosstab()` está diseñada para este propósito y es particularmente útil cuando quieres examinar la frecuencia o distribución de una variable categórica en relación con otra. Por defecto, computa una tabla de frecuencia, pero también puedes pasar un arreglo de valores y una función de agregación para análisis más avanzados.

Sintaxys basica:
```python
pd.crosstab(df[column1], df[column2])
```

In [21]:
# Example I
pd.crosstab(index=df["Department"], columns=df["EducationField"])

EducationField,Human Resources,Life Sciences,Marketing,Medical,Other,Technical Degree
Department,,,,,,
Human Resources,27,16,0,13,3,4
Research & Development,0,440,0,363,64,94
Sales,0,150,159,88,15,34

In [22]:
# Example II
pd.crosstab(index=df["Department"], columns=df["EducationField"], values=df["MonthlyIncome"], aggfunc="mean")

EducationField,Human Resources,Life Sciences,Marketing,Medical,Other,Technical Degree
Department,,,,,,
Human Resources,7241.148148,6914.062500,NaN,6594.076923,5016.666667,3081.250000
Research & Development,NaN,6179.984091,NaN,6539.223140,6278.687500,5760.819149
Sales,NaN,7246.233333,7348.584906,6377.227273,5398.733333,6066.294118

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

## Combinación de datos: mezclando dataframes

En el análisis de datos del mundo real, a menudo te encuentras con escenarios donde necesitas combinar datos de diferentes fuentes u organizarlos de manera diferente para realizar un análisis significativo. Pandas proporciona varios métodos potentes para fusionar, unir y concatenar DataFrames que te ayudan a gestionar este proceso de manera eficiente.

Para una comprensión completa de estas técnicas, considera explorar los siguientes recursos:
- [Real Python: Pandas Merge, Join, y Concat](https://realpython.com/pandas-merge-join-and-concat/)
- [Documentación de Pandas: Fusión y Unión](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)

### Concat: dos cosas juntas
La concatenación es una de las operaciones fundamentales para combinar DataFrames. Con `pd.concat()`, puedes unir DataFrames a lo largo de un eje especificado, usualmente a lo largo del eje 0 (verticalmente), para apilarlos uno debajo del otro. Esto alinea las columnas basadas en sus etiquetas, lo que lo convierte en una herramienta valiosa para extender o añadir datos verticalmente.

La sintaxis básica para la concatenación es la siguiente:
```python
result = pd.concat([df1, df2, ...], axis=0)
```
Aquí, `df1`, `df2`, y así sucesivamente son los DataFrames que quieres concatenar. El argumento `axis=0` asegura que la concatenación ocurra verticalmente, alineando las filas.

Dominando la concatenación, puedes gestionar de manera eficiente conjuntos de datos que crecen con el tiempo o combinar datos de varias fuentes en un único DataFrame cohesivo. Esto es particularmente útil cuando se trata de datos de series temporales, archivos de registro u otras situaciones donde los datos se recopilan de manera incremental.

Para profundizar más en la concatenación y explorar opciones más avanzadas, puedes referirte a los recursos proporcionados y la documentación oficial de Pandas sobre [pd.concat()](https://pandas.pydata.org/docs/reference/api/pandas.concat.html).

In [23]:
# Load some data
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',
                             sep='|', 
                             index_col='user_id')

In [24]:
df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [25]:
# Let's sample it

# Muestras aleatorias del 10% de los datos

first_df = df.sample(frac=0.1)
second_df = df.sample(frac=0.1)

In [26]:
second_df

         age gender     occupation zip_code
user_id
702       37      M          other    89104
211       66      M       salesman    32605
286       27      M        student    15217
126       28      F         lawyer    20015
179       15      M  entertainment    20755
...      ...    ...            ...      ...
347       18      M        student    90210
379       44      M     programmer    98117
101       15      M        student    05146
742       35      M        student    29210
781       20      M        student    48825

[94 rows x 4 columns]

In [27]:
second_df.shape

(94, 4)

#### Concatenating on axis 0 (rows)

In [28]:
pd.concat([first_df, second_df], axis=0, keys=["Table 1", "Table 2"])

                 age gender  occupation zip_code
        user_id
Table 1 657       26      F        none    78704
        690       35      M    salesman    63304
        138       46      M      doctor    53211
        365       29      M      lawyer    20009
        591       57      F   librarian    92093
...              ...    ...         ...      ...
Table 2 347       18      M     student    90210
        379       44      M  programmer    98117
        101       15      M     student    05146
        742       35      M     student    29210
        781       20      M     student    48825

[188 rows x 4 columns]

- Esta operación concatena los DataFrames `first_df` y `second_df` verticalmente (a lo largo de `axis=0`), lo que significa que los apila uno encima del otro.

- El parámetro `keys` se utiliza para especificar un índice jerárquico para el DataFrame resultante. En este caso, estás dando a cada DataFrame original una etiqueta: "Tabla 1" y "Tabla 2".

- Como resultado, la salida será un nuevo DataFrame con una estructura jerárquica (MultiIndex). Puedes pensar en ello como tener dos secciones etiquetadas "Tabla 1" y "Tabla 2", donde cada sección contiene los datos del respectivo DataFrame original.

#### Concatenating on axis 1 (columns)

In [29]:
pd.concat([first_df, second_df], axis=1, keys=["left", "right"])

         left                            right
          age gender occupation zip_code   age gender occupation zip_code
user_id
657      26.0      F       none    78704  26.0      F       none    78704
690      35.0      M   salesman    63304   NaN    NaN        NaN      NaN
138      46.0      M     doctor    53211   NaN    NaN        NaN      NaN
365      29.0      M     lawyer    20009   NaN    NaN        NaN      NaN
591      57.0      F  librarian    92093   NaN    NaN        NaN      NaN
...       ...    ...        ...      ...   ...    ...        ...      ...
308       NaN    NaN        NaN      NaN  60.0      M    retired    95076
347       NaN    NaN        NaN      NaN  18.0      M    student    90210
101       NaN    NaN        NaN      NaN  15.0      M    student    05146
742       NaN    NaN        NaN      NaN  35.0      M    student    29210
781       NaN    NaN        NaN      NaN  20.0      M    student    48825

[177 rows x 8 columns]

- Esta operación concatena los DataFrames `first_df` y `second_df` horizontalmente (a lo largo de `axis=1`), lo que significa que los combina uno al lado del otro.

- Similar a la primera operación, el parámetro `keys` se utiliza para etiquetar las columnas resultantes de cada DataFrame original. Aquí, las estás etiquetando como "izquierda" y "derecha".

- La salida será un nuevo DataFrame donde las columnas están organizadas en dos secciones etiquetadas "izquierda" y "derecha", representando los datos de los respectivos DataFrames originales.

![sql joins](https://upload.wikimedia.org/wikipedia/commons/9/9d/SQL_Joins.svg)

### Merge: related columns

La función `merge()` en Pandas es una herramienta poderosa cuando necesitas combinar filas de múltiples DataFrames basados en columnas relacionadas. Se utiliza principalmente para uniones al estilo de bases de datos donde quieres reunir datos de diferentes fuentes que comparten columnas clave comunes.

**Entendiendo la Función `merge()`**:

Puedes pensar en la función `merge()` como una manera de fusionar filas que comparten datos a través de columnas especificadas. Te permite realizar varios tipos de uniones, como uniones internas, externas, izquierdas y derechas, que determinan cómo se combinan las filas de ambos DataFrames.

- **Unión Interna (Inner Join)**: Este tipo de unión devuelve solo las filas donde hay una coincidencia en ambos DataFrames basada en las columnas especificadas. Las filas sin coincidencia se excluyen.

- **Unión Externa (Full Outer Join)**: Una unión externa devuelve todas las filas cuando hay una coincidencia en cualquiera de los DataFrames izquierdo o derecho. Las filas no emparejadas contendrán valores NaN para los datos faltantes.

- **Unión Izquierda (Left Outer Join)**: Una unión izquierda devuelve todas las filas del DataFrame izquierdo y las filas emparejadas del DataFrame derecho. Las filas no emparejadas del DataFrame izquierdo aún se incluirán.

- **Unión Derecha (Right Outer Join)**: A la inversa, una unión derecha devuelve todas las filas del DataFrame derecho y las filas emparejadas del DataFrame izquierdo. Las filas no emparejadas del DataFrame derecho aún se incluirán.

**Uso y Sintaxis**:

Aquí tienes un esquema básico de cómo usar la función `merge()`:

```python
merged_df = pd.merge(left_df, right_df, on='common_column', how='join_type')
```
- **Uso y Sintaxis:**

  - `left_df`: El DataFrame izquierdo que quieres fusionar.
  - `right_df`: El DataFrame derecho que quieres fusionar.
  - `on`: La(s) columna(s) en las que quieres realizar la fusión. Estas columnas deberían existir en ambos DataFrames y servir como la(s) clave(s) para la operación de fusión.
  - `how`: El tipo de unión que quieres realizar (por ejemplo, 'inner', 'outer', 'left', 'right').

- **Beneficios de Usar `merge()`:**

  - **Integración de Datos:** Merge ayuda a integrar datos de múltiples fuentes o tablas en un conjunto de datos único y comprensivo.

  - **Análisis de Datos:** Simplifica el proceso de combinar información relacionada, facilitando el análisis de datos y la derivación de insights.

  - **Operaciones de Base de Datos:** `merge()` se alinea con operaciones comunes de bases de datos como las uniones SQL, permitiendo a los analistas de datos aprovechar su conocimiento de SQL dentro de Pandas.

  - **Consultas Complejas:** Puedes manejar relaciones de datos complejas y realizar consultas que involucren múltiples tablas de manera eficiente.

Fusionar DataFrames usando `merge()` es una operación fundamental en la manipulación y análisis de datos, especialmente cuando se trata de conjuntos de datos del mundo real de diversas fuentes. Te proporciona la flexibilidad para controlar cómo se combinan los datos y te permite trabajar con relaciones de datos complejas.

Para obtener información más detallada y opciones, puedes referirte a la documentación oficial de Pandas sobre [`merge()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html).

#### LEFT Merge

In [30]:
from IPython.display import display_html
# pip install jinja2

In [31]:
df1 = pd.DataFrame(
    {
        "key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)


df2 = pd.DataFrame(
    {
        "key1": ["K0", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K0", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)

df3 = pd.DataFrame(
    {
        "key1": ["K90", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K5", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "Y": ["D0", "D70", "D2", "D5"],
    }
)

In [32]:
# Just showing tables
df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
display_html(df1_styler._repr_html_() + " " + df2_styler._repr_html_(), raw=True)

,key1,key2,A,B
0,K0,K0,A0,B0
1,K0,K1,A1,B1
2,K1,K0,A2,B2
3,K2,K1,A3,B3
,key1,key2,C,D
0,K0,K0,C0,D0
1,K1,K0,C1,D1
2,K1,K0,C2,D2
3,K2,K0,C3,D3

In [33]:
# merge, default is inner
pd.merge(df1, df2)

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [34]:
# merges, now is a left
pd.merge(df1, df2, how="left")

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [35]:
# merges, now is a right
pd.merge(df1, df2, how="right")

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [36]:
# merge, now is inner
pd.merge(df1, df2, how="inner")

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [37]:
# merge, now is outer
outer_merge = pd.merge(df1, df2, how="outer")

### Merging & Concatenating in two different columns

In [38]:
df1_docs = pd.DataFrame({'Locations': ['Spain', 'France', 'Portugal', 'Spain'],
                    'city': ["Barcelona", "Paris", "Lisbon", "Madrid"]})
df2_docs = pd.DataFrame({'More locations': ['Spain', 'France', 'Portugal', 'Spain'],
                    'city': ["Madrid", "Lyon", "Porto", "Albacete"]})

#### Concatenating in two different columns

In [39]:
pd.concat([df1_docs, df2_docs], axis=1, keys=["1st table", "2nd table"])

  1st table                 2nd table
  Locations       city More locations      city
0     Spain  Barcelona          Spain    Madrid
1    France      Paris         France      Lyon
2  Portugal     Lisbon       Portugal     Porto
3     Spain     Madrid          Spain  Albacete

#### Merging in two different columns

In [40]:
df1_docs.merge(df2_docs, left_on='Locations', right_on='More locations', suffixes = ["_fromlastyear", "_fromthisyear"])

  Locations city_fromlastyear More locations city_fromthisyear
0     Spain         Barcelona          Spain            Madrid
1     Spain         Barcelona          Spain          Albacete
2    France             Paris         France              Lyon
3  Portugal            Lisbon       Portugal             Porto
4     Spain            Madrid          Spain            Madrid
5     Spain            Madrid          Spain          Albacete

In [41]:
df1_docs.merge(df2_docs,  left_on='Locations', right_on='More locations', suffixes = ["_fromleft", "_fromright"])

  Locations city_fromleft More locations city_fromright
0     Spain     Barcelona          Spain         Madrid
1     Spain     Barcelona          Spain       Albacete
2    France         Paris         France           Lyon
3  Portugal        Lisbon       Portugal          Porto
4     Spain        Madrid          Spain         Madrid
5     Spain        Madrid          Spain       Albacete

### Join: relating index
The join, unlike the merge, will join the dataframes and where there are no records in the "index" it will put NaN

In [42]:
import numpy as np
import pandas as pd   
from IPython.display import display_html

In [43]:
left_df = pd.DataFrame({"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"])
right_df = pd.DataFrame({"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"])

In [44]:
left_df.join(right_df, how="inner")

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

### Diferencias entre join y merge
Al combinar DataFrames en Pandas, tienes dos métodos principales a tu disposición: `join()` y `merge()`. Cada método tiene su propio conjunto de características y casos de uso. A continuación, se presenta una comparación de estos dos métodos basada en diferentes características de unión:

| Característica de Unión             | `join()` | `merge()` |
|-------------------------------------|:--------:|:---------:|
| Unión Interna (Inner Join)          |   Sí     |    Sí     |
| Unión Izquierda (Left Join)         |   Sí     |    Sí     |
| Unión Derecha (Right Join)          |   Sí     |    Sí     |
| Unión Externa (Outer Join)          |   Sí     |    Sí     |
| Unión Cruzada (Cross Join)          |    X     |    Sí     |
| Unión en Índices                    |   Sí     |    Sí     |
| Unión en Columnas                   |    X     |    Sí     |
| Izquierda en Columna, Derecha en Índice |   Sí  |    Sí     |
| Izquierda en Índice, Derecha en Columna |    X  |    Sí     |

**Explicación:**

- **Unión Interna (Inner Join):** Tanto `join()` como `merge()` admiten uniones internas, que devuelven solo las filas con valores coincidentes en ambos DataFrames.

- **Unión Izquierda (Left Join):** Ambos métodos permiten uniones izquierdas, que incluyen todas las filas del DataFrame izquierdo y las filas coincidentes del DataFrame derecho.

- **Unión Derecha (Right Join):** Ambos métodos admiten uniones derechas, que incluyen todas las filas del DataFrame derecho y las filas coincidentes del DataFrame izquierdo.

- **Unión Externa (Outer Join):** Ambos métodos permiten uniones externas, que incluyen todas las filas de ambos DataFrames, rellenando los valores faltantes con NaN donde sea necesario.

- **Unión Cruzada (Cross Join):** Mientras que `merge()` puede realizar uniones cruzadas, `join()` no las admite. Las uniones cruzadas resultan en un producto cartesiano de filas entre dos DataFrames.

- **Unión en Índices:** Tanto `join()` como `merge()` pueden realizar uniones basadas en el índice de los DataFrames.

- **Unión en Columnas:** `merge()` permite unir DataFrames en columnas específicas, mientras que `join()` no ofrece esta capacidad.

- **Izquierda en Columna, Derecha en Índice:** Ambos métodos admiten la unión en una columna del DataFrame izquierdo y el índice del DataFrame derecho.

- **Izquierda en Índice, Derecha en Columna:** `merge()` puede unir en el índice del DataFrame izquierdo y una columna del DataFrame derecho, pero `join()` no ofrece esta opción.

Esta comparación debería ayudarte a elegir el método apropiado basado en tus requisitos específicos de fusión.

## Business challenge: IronHack Delivery orders analysis (use pycharm)

En este análisis, exploraremos un conjunto de datos que contiene información sobre pedidos de socios falsos dentro de la aplicación. Los socios falsos son tiendas no integradas directamente con Glovo, y nuestro equipo de contenido gestiona su catálogo de productos y precios. Este conjunto de datos proporciona detalles sobre los pedidos, discrepancias de pago y otra información relevante.

1. Descripción del Conjunto de Datos
    - `order_id`: Identificador único para cada pedido.
    - `activation_time_local`: Hora local cuando se activó el pedido.
    - `country_code`: Código de país para el pedido.
    - `store_address`: Dirección de la tienda.
    - `final_status`: El estado final del pedido.
    - `payment_status`: El estado de pago del pedido.
    - `products`: Número de productos en el pedido.
    - `products_total`: Monto total en el momento de la compra en euros (€).
    - `purchase_total_price`: Monto que el mensajero pagó en la tienda en euros (€).

2. Antecedentes
Los pedidos de socios falsos pueden exhibir discrepancias entre el monto total en el momento de la compra (`products_total`) y el monto que el mensajero paga en la tienda (`purchase_total_price`). Cuando `products_total` es menor que `purchase_total_price`, los clasificamos como "pedidos no autorizados suficientemente". Entender estas discrepancias es crucial para la transición de cobro contra entrega a un modelo de autorización y captura.

3. Preguntas Clave
Durante este proceso de Análisis Exploratorio de Datos (EDA), apuntamos a responder las siguientes preguntas:

    1. ¿Qué porcentaje de pedidos no están suficientemente autorizados?
    2. ¿Qué porcentaje de pedidos estarían correctamente autorizados con una autorización incremental del 20% sobre el monto en el momento de la compra?
    3. ¿Existen diferencias en los porcentajes anteriores cuando se dividen por país?
    4. Para los pedidos restantes fuera de la autorización incremental, ¿qué valores serían necesarios para capturar el monto restante?
    5. ¿Cuáles son las tiendas más problemáticas en términos de pedidos y valor monetario?
    6. Para los pedidos no autorizados suficientemente, ¿existe una correlación entre la diferencia de precio y las cancelaciones de pedidos? En otras palabras, ¿es más probable que un pedido sea cancelado a medida que aumenta la diferencia de precio?

A través de este análisis, apuntamos a obtener insights sobre las fluctuaciones de precios de pedidos pasados y evaluar el riesgo asociado con la transición a un nuevo modelo de autorización.

¡Sumérgete en el conjunto de datos y comienza a explorar!

In [47]:
# Load the dataset
df = pd.read_csv("datasets/fake_orders_test.csv")
headers = ['order_id', 'activation_time_local', 'country_code', 'store_address',
           'final_status', 'payment_status', 'products', 'products_total',
           'purchase_total_price']
df.columns = headers

In [48]:
df

,order_id,activation_time_local,country_code,store_address,final_status,payment_status,products,products_total,purchase_total_price
0,33512615,2019-03-10 23:58:32.000000,TR,28725,DeliveredStatus,PAID,1,3.76,3.76
1,33512451,2019-03-10 23:57:56.000000,TR,28725,DeliveredStatus,PAID,1,2.86,2.86
2,33530892,2019-03-10 23:57:33.000000,ES,19777,CanceledStatus,PAID,1,12.95,0.00
3,33557765,2019-03-10 23:57:21.000000,AR,34565,DeliveredStatus,PAID,2,2.86,6.48
4,33512273,2019-03-10 23:57:13.000000,TR,63536,DeliveredStatus,PAID,4,1.88,1.96
...,...,...,...,...,...,...,...,...,...
60394,31960607,2019-03-01 00:04:31.000000,TR,68820,DeliveredStatus,PAID,2,10.17,10.33
60395,32002079,2019-03-01 00:03:53.000000,AR,50175,CanceledStatus,PAID,1,3.80,0.00
60396,32002046,2019-03-01 00:03:06.000000,AR,55159,DeliveredStatus,PAID,1,4.24,4.91
60397,32001950,2019-03-01 00:01:01.000000,AR,62504,CanceledStatus,PAID,1,4.91,0.00
60398,32001318,2019-03-01 00:01:00.000000,AR,55159,DeliveredStatus,NOT_PAID,2,5.14,5.58

### 1. ¿Qué porcentaje de pedidos no están suficientemente autorizados?

In [51]:
df['not_authorized'] = df['products_total'] < df['purchase_total_price']
df['not_authorized']

0        False
1        False
2        False
3         True
4         True
         ...
60394     True
60395    False
60396     True
60397    False
60398     True
Name: not_authorized, Length: 60399, dtype: bool

In [52]:
df.head()

,order_id,activation_time_local,country_code,store_address,final_status,payment_status,products,products_total,purchase_total_price,not_authorized
0,33512615,2019-03-10 23:58:32.000000,TR,28725,DeliveredStatus,PAID,1,3.76,3.76,False
1,33512451,2019-03-10 23:57:56.000000,TR,28725,DeliveredStatus,PAID,1,2.86,2.86,False
2,33530892,2019-03-10 23:57:33.000000,ES,19777,CanceledStatus,PAID,1,12.95,0.00,False
3,33557765,2019-03-10 23:57:21.000000,AR,34565,DeliveredStatus,PAID,2,2.86,6.48,True
4,33512273,2019-03-10 23:57:13.000000,TR,63536,DeliveredStatus,PAID,4,1.88,1.96,True

In [53]:
df['not_authorized'].value_counts(normalize=True)
# 0.575837 --> 57.5837%

not_authorized
True     0.575837
False    0.424163
Name: proportion, dtype: float64

### 2. ¿Qué porcentaje de pedidos estarían correctamente autorizados con una autorización incremental del 20% sobre el monto en el momento de la compra?

In [58]:
df['not_authorized_20'] = df['products_total']*1.2 < df['purchase_total_price']
df['not_authorized_20']

0        False
1        False
2        False
3         True
4        False
         ...
60394    False
60395    False
60396    False
60397    False
60398    False
Name: not_authorized_20, Length: 60399, dtype: bool

In [59]:
df.head()

,order_id,activation_time_local,country_code,store_address,final_status,payment_status,products,products_total,purchase_total_price,not_authorized,not_authorized_20
0,33512615,2019-03-10 23:58:32.000000,TR,28725,DeliveredStatus,PAID,1,3.76,3.76,False,False
1,33512451,2019-03-10 23:57:56.000000,TR,28725,DeliveredStatus,PAID,1,2.86,2.86,False,False
2,33530892,2019-03-10 23:57:33.000000,ES,19777,CanceledStatus,PAID,1,12.95,0.00,False,False
3,33557765,2019-03-10 23:57:21.000000,AR,34565,DeliveredStatus,PAID,2,2.86,6.48,True,True
4,33512273,2019-03-10 23:57:13.000000,TR,63536,DeliveredStatus,PAID,4,1.88,1.96,True,False

In [61]:
df['not_authorized_20'].value_counts(normalize=True)
# 0.690359 --> 69.0359 %

not_authorized_20
False    0.690359
True     0.309641
Name: proportion, dtype: float64

### 3. ¿Existen diferencias en los porcentajes anteriores cuando se dividen por país?

In [70]:
df[(df['not_authorized'] == True) | (df['not_authorized_20'] == False)][['not_authorized','not_authorized_20','country_code']].value_counts(normalize=True)

not_authorized  not_authorized_20  country_code
False           False              AR              0.086061
                                   ES              0.080150
True            True               AR              0.073395
                False              ES              0.071442
                True               ES              0.060431
                                                     ...
False           False              CI              0.000066
True            True               PR              0.000066
                                   CI              0.000033
False           False              BR              0.000017
True            True               BR              0.000017
Name: proportion, Length: 66, dtype: float64

In [83]:
#df[["not_authorized", "not_authorized_20", "country_code"]].groupby("country_code").value_counts(normalize=True)

country_code  not_authorized  not_authorized_20
AR            False           False                0.394057
              True            True                 0.336062
                              False                0.269881
BR            False           False                0.500000
              True            True                 0.500000
                                                     ...
UA            True            True                 0.273367
                              False                0.212916
UY            False           False                0.573684
              True            False                0.221053
                              True                 0.205263
Name: proportion, Length: 66, dtype: float64

In [133]:
df_new = pd.DataFrame(df[["not_authorized", "country_code"]].groupby(['country_code']).value_counts(normalize=True))
df_new.head(50)

                             proportion
country_code not_authorized
AR           True              0.605943
             False             0.394057
BR           False             0.500000
             True              0.500000
CI           False             0.666667
             True              0.333333
CL           True              0.870471
             False             0.129529
CR           False             0.551039
             True              0.448961
DO           True              0.636000
             False             0.364000
EC           True              0.642344
             False             0.357656
EG           True              0.629103
             False             0.370897
ES           True              0.621974
             False             0.378026
FR           True              0.656367
             False             0.343633
GE           True              0.518315
             False             0.481685
GT           False             0.668430
             True              0.331570
IT           True              0.553063
             False             0.446937
KE           True              0.563830
             False             0.436170
MA           False             0.593137
             True              0.406863
PA           True              0.608095
             False             0.391905
PE           True              0.559039
             False             0.440961
PR           False             0.575758
             True              0.424242
PT           True              0.580858
             False             0.419142
RO           False             0.535764
             True              0.464236
TR           True              0.506616
             False             0.493384
UA           False             0.513717
             True              0.486283
UY           False             0.573684
             True              0.426316

In [134]:
df[["not_authorized", "not_authorized_20", "country_code"]].groupby(['country_code']).mean()

              not_authorized  not_authorized_20
country_code
AR                  0.605943           0.336062
BR                  0.500000           0.500000
CI                  0.333333           0.333333
CL                  0.870471           0.870471
CR                  0.448961           0.201445
DO                  0.636000           0.380000
EC                  0.642344           0.374003
EG                  0.629103           0.343545
ES                  0.621974           0.285023
FR                  0.656367           0.326779
GE                  0.518315           0.316850
GT                  0.331570           0.202822
IT                  0.553063           0.299145
KE                  0.563830           0.265957
MA                  0.406863           0.224877
PA                  0.608095           0.330701
PE                  0.559039           0.219018
PR                  0.424242           0.121212
PT                  0.580858           0.360836
RO                  0.464236           0.278265
TR                  0.506616           0.311122
UA                  0.486283           0.273367
UY                  0.426316           0.205263

In [98]:
df_new = pd.DataFrame(df[["not_authorized", "not_authorized_20", "country_code"]].groupby(['country_code']).value_counts(normalize=True))
df_new.head(50)

                                               proportion
country_code not_authorized not_authorized_20
AR           False          False                0.394057
             True           True                 0.336062
                            False                0.269881
BR           False          False                0.500000
             True           True                 0.500000
CI           False          False                0.666667
             True           True                 0.333333
CL           True           True                 0.870471
             False          False                0.129529
CR           False          False                0.551039
             True           False                0.247516
                            True                 0.201445
DO           True           True                 0.380000
             False          False                0.364000
             True           False                0.256000
EC           True           True                 0.374003
             False          False                0.357656
             True           False                0.268341
EG           False          False                0.370897
             True           True                 0.343545
                            False                0.285558
ES           False          False                0.378026
             True           False                0.336951
                            True                 0.285023
FR           False          False                0.343633
             True           False                0.329588
                            True                 0.326779
GE           False          False                0.481685
             True           True                 0.316850
                            False                0.201465
GT           False          False                0.668430
             True           True                 0.202822
                            False                0.128748
IT           False          False                0.446937
             True           True                 0.299145
                            False                0.253917
KE           False          False                0.436170
             True           False                0.297872
                            True                 0.265957
MA           False          False                0.593137
             True           True                 0.224877
                            False                0.181985
PA           False          False                0.391905
             True           True                 0.330701
                            False                0.277394
PE           False          False                0.440961
             True           False                0.340021
                            True                 0.219018
PR           False          False                0.575758
             True           False                0.303030

### 4. Para los pedidos restantes fuera de la autorización incremental, ¿qué valores serían necesarios para capturar el monto restante?

In [122]:
df['diffs'] = df['purchase_total_price'] - df['products_total']
df.head()

,order_id,activation_time_local,country_code,store_address,final_status,payment_status,products,products_total,purchase_total_price,not_authorized,not_authorized_20,diffs
0,33512615,2019-03-10 23:58:32.000000,TR,28725,DeliveredStatus,PAID,1,3.76,3.76,False,False,0.00
1,33512451,2019-03-10 23:57:56.000000,TR,28725,DeliveredStatus,PAID,1,2.86,2.86,False,False,0.00
2,33530892,2019-03-10 23:57:33.000000,ES,19777,CanceledStatus,PAID,1,12.95,0.00,False,False,-12.95
3,33557765,2019-03-10 23:57:21.000000,AR,34565,DeliveredStatus,PAID,2,2.86,6.48,True,True,3.62
4,33512273,2019-03-10 23:57:13.000000,TR,63536,DeliveredStatus,PAID,4,1.88,1.96,True,False,0.08

In [123]:
df['diffs'].idxmax()

7572

In [124]:
df['diffs'].iloc[45489]

np.float64(-221.48)

In [125]:
df['diffs'].max()

np.float64(264.36)

In [126]:
df['diffs']

0         0.00
1         0.00
2       -12.95
3         3.62
4         0.08
         ...
60394     0.16
60395    -3.80
60396     0.67
60397    -4.91
60398     0.44
Name: diffs, Length: 60399, dtype: float64

In [118]:
df.pivot_table(
    values = "diffs",
    index = ['products_total','purchase_total_price'],
    aggfunc = "max"
).sort_values(by=['diffs'],ascending=False)

                                      diffs
products_total purchase_total_price
221.48         0.00                  221.48
178.00         0.00                  178.00
176.60         0.00                  176.60
159.00         0.00                  159.00
129.99         0.00                  129.99
...                                     ...
8.85           223.79               -214.94
9.48           264.41               -254.93
9.12           265.03               -255.91
1.43           265.76               -264.33
0.89           265.25               -264.36

[41237 rows x 1 columns]

In [127]:
df[df['not_authorized_20'] == True]

,order_id,activation_time_local,country_code,store_address,final_status,payment_status,products,products_total,purchase_total_price,not_authorized,not_authorized_20,diffs
3,33557765,2019-03-10 23:57:21.000000,AR,34565,DeliveredStatus,PAID,2,2.86,6.48,True,True,3.62
9,33523444,2019-03-10 23:53:38.000000,RO,72549,DeliveredStatus,PAID,2,2.05,10.17,True,True,8.12
11,33530379,2019-03-10 23:52:20.000000,FR,4444,DeliveredStatus,PAID,1,8.10,10.20,True,True,2.10
19,33509944,2019-03-10 23:48:55.000000,TR,44528,DeliveredStatus,PAID,2,4.42,5.73,True,True,1.31
29,33503904,2019-03-10 23:43:03.000000,TR,34471,DeliveredStatus,PAID,1,5.03,10.71,True,True,5.68
...,...,...,...,...,...,...,...,...,...,...,...,...
60370,32004484,2019-03-01 01:06:46.000000,AR,33382,DeliveredStatus,PAID,2,9.83,21.44,True,True,11.61
60372,31969645,2019-03-01 00:57:47.000000,TR,44473,DeliveredStatus,PAID,1,3.28,6.56,True,True,3.28
60373,31968802,2019-03-01 00:51:19.000000,TR,52885,DeliveredStatus,PAID,1,2.46,5.25,True,True,2.79
60379,31965637,2019-03-01 00:30:50.000000,TR,44528,DeliveredStatus,PAID,1,3.44,6.89,True,True,3.45
60388,32002620,2019-03-01 00:14:57.000000,AR,62623,DeliveredStatus,PAID,2,1.79,5.36,True,True,3.57

In [129]:
df[df['not_authorized_20'] == True].pivot_table(
                                    values = "diffs",
                                    index = ['products_total','purchase_total_price'],
                                    aggfunc = "max"
                                ).sort_values(by=['diffs'],ascending=True)

                                      diffs
products_total purchase_total_price
0.07           0.09                    0.02
               0.10                    0.03
0.10           0.15                    0.05
0.22           0.27                    0.05
0.54           0.66                    0.12
...                                     ...
8.85           223.79                214.94
9.48           264.41                254.93
9.12           265.03                255.91
1.43           265.76                264.33
0.89           265.25                264.36

[16857 rows x 1 columns]

In [ ]:
# df['products_total']*1.2 < df['purchase_total_price']

In [110]:
df.groupby(["order_id"]).agg({"diffs":"max"})

diffs    221.48
dtype: float64

In [104]:
df['diffs'].max()

np.float64(221.48)

In [105]:
df['diffs'].min()

np.float64(-264.36)

# RECAP

## Subconjuntos
- Seleccionar columnas específicas:
  - `df[[col1, col2]]`

## Agreggations
### Groupby
- Realizar agregaciones basadas en una columna categórica:
  - `df[[col1, col2]].groupby(CATEGORICAL).agg({QUANTITATIVE_1: "mean", QUANTITATIVE_2: "max"})`
  - `df[[col1, col2]].groupby(CATEGORICAL).mean()`
- Funciones de agregación comunes:
  - count (conteo), mean (media), max (máximo), min (mínimo), median (mediana), std (desviación estándar), y más.

### Pivot table
- Crear tablas pivote para resumir datos:
  - `df.pivot_table(values="MonthlyIncome", index="Department", aggfunc="mean")`
- Las tablas pivote ofrecen una forma concisa de agregar y comparar datos.

### Crosstab
- Calcular tabulaciones cruzadas para analizar la relación entre dos variables categóricas:
  - El comportamiento predeterminado cuenta ocurrencias.
  - Usa `aggfunc="mean"` para agregar variables cuantitativas.
  - Asegúrate de seleccionar variables apropiadas.

## UNION & MERGE & CONCAT

### Concatenación
- Combinar DataFrames físicamente (no relacionalmente):
  - Lado a lado: `concat` en `axis=1`.
    - Usar cuando los DataFrames no comparten columnas o tienen una clave común.
  - Arriba & abajo: `concat` en `axis=0` (añadiendo filas).
    - Adecuado cuando los DataFrames comparten columnas.

### Merge & Join (Pandas)
- Merge: Combinar DataFrames basados en columnas comunes.
- Join: Combinar DataFrames basados en índices comunes.
- En SQL, las operaciones de unión se realizan sobre columnas.

Estos puntos de recapitulación resumen operaciones clave para la manipulación y análisis de datos en Pandas. Puedes usar estas técnicas para seleccionar, agregar y combinar datos de manera eficiente, ayudándote a obtener insights de tus conjuntos de datos.

## Metodos usuales de pandas
```python
df.head() # prints the head, default 5 rows
df.tail() # set the tail, default 5 rows
df.describe() # statistical description
df.info() # df information
df.columns # show column
df.index # show index
df.dtypes # show column data types
df.plot() # make a plot
df.hist() # make a histogram
df.col.value_counts() # counts the unique values ​​of a column
df.col.unique() # returns unique values ​​from a column
df.copy() # copies the df
df.drop() # remove columns or rows (axis=0,1)
df.dropna() # remove nulls
df.fillna() # fills nulls
df.shape # dimensions of the df
df._get_numeric_data() # select numeric columns
df.rename() # rename columns
df.str.replace() # replace columns of strings
df.astype(dtype='float32') # change the data type
df.iloc[] # locate by index
df.loc[] # locate by element
df.transpose() # transposes the df
df.T
df.sample(n, frac) # sample from df
df.col.sum() # sum of a column
df.col.max() # maximum of a column
df.col.min() # minimum of one column
df[col] # select column
df.col
df.isnull() # null values
df.isna()
df.notna() # not null values
df.drop_duplicates() # remove duplicates
df.reset_index(inplace=True) # reset the index and overwrite
```

## Más material

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)